igorwwwwwwwwwwwwwwwwwwww/php-src/sapi/rp2350/src/rp2350_http_stream.c
#include <stdarg.h>
#include <stdbool.h>
#include <stdint.h>
#include <inttypes.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>

#include "pico/stdlib.h"
#include "pico/time.h"
#include "pico/cyw43_arch.h"
#include "lwip/ip4_addr.h"
#include "lwip/ip_addr.h"
#include "lwip/netif.h"
#include "lwip/dns.h"
#include "lwip/tcp.h"
#include "lwip/pbuf.h"
#include "lwip/err.h"
#include "lwip/altcp.h"
#include "lwip/altcp_tls.h"
#include "mbedtls/ssl.h"
#include "nghttp2/nghttp2.h"
#include "picohttpparser.h"

#include "Zend/zend.h"
#include "Zend/zend_API.h"
#include "Zend/zend_compile.h"
#include "Zend/zend_smart_str.h"
#include "SAPI.h"
#include "main/php_memory_streams.h"
#include "main/php_streams.h"

#include "src/rp2350_ca_bundle.h"
#include "rp2350_eval.h"
#include "rp2350_http_stream.h"
#include "rp2350_wifi.h"

static struct altcp_tls_config *s_http_tls_config = NULL;
static struct altcp_tls_config *s_h2_tls_config = NULL;
static bool rp2350_parse_http_url(const char *url, char *host, size_t host_size, u16_t *port, const char **path, bool *is_https);
static struct altcp_pcb *rp2350_altcp_tls_alloc_with_sni(void *arg, u8_t ip_type);
bool rp2350_http_tls_config_ready(void)
{
	static const char *s_http1_alpn[] = { "http/1.1", NULL };

	if (s_http_tls_config != NULL) {
		return true;
	}

	cyw43_arch_lwip_begin();
	s_http_tls_config = altcp_tls_create_config_client(rp2350_ca_bundle_pem, rp2350_ca_bundle_pem_len);
	if (s_http_tls_config != NULL) {
		if (altcp_tls_configure_alpn_protocols(s_http_tls_config, s_http1_alpn) != 0) {
			altcp_tls_free_config(s_http_tls_config);
			s_http_tls_config = NULL;
		}
	}
	cyw43_arch_lwip_end();

	return s_http_tls_config != NULL;
}

bool rp2350_h2_tls_config_ready(void)
{
	static const char *s_h2_alpn[] = { "h2", "http/1.1", NULL };

	if (s_h2_tls_config != NULL) {
		return true;
	}

	cyw43_arch_lwip_begin();
	s_h2_tls_config = altcp_tls_create_config_client(rp2350_ca_bundle_pem, rp2350_ca_bundle_pem_len);
	if (s_h2_tls_config != NULL) {
		if (altcp_tls_configure_alpn_protocols(s_h2_tls_config, s_h2_alpn) != 0) {
			altcp_tls_free_config(s_h2_tls_config);
			s_h2_tls_config = NULL;
		}
	}
	cyw43_arch_lwip_end();

	return s_h2_tls_config != NULL;
}

typedef struct {
	volatile bool done;
	volatile bool ok;
	ip_addr_t addr;
} rp2350_dns_query_t;

typedef struct {
	struct tcp_pcb *pcb;
	char *rx;
	size_t rx_len;
	size_t rx_cap;
	volatile bool connected;
	volatile bool done;
	volatile bool had_error;
	volatile bool truncated;
	err_t last_err;
} rp2350_tcp_ctx_t;

typedef struct {
	struct altcp_pcb *pcb;
	char *rx;
	size_t rx_len;
	size_t rx_cap;
	absolute_time_t last_rx_time;
	volatile bool connected;
	volatile bool done;
	volatile bool had_error;
	volatile bool truncated;
	err_t last_err;
} rp2350_altcp_ctx_t;

static void rp2350_dns_found_cb(const char *name, const ip_addr_t *ipaddr, void *arg)
{
	rp2350_dns_query_t *q = (rp2350_dns_query_t *)arg;
	(void)name;
	if (q == NULL) {
		return;
	}
	if (ipaddr != NULL) {
		q->addr = *ipaddr;
		q->ok = true;
	}
	q->done = true;
}

static bool rp2350_lwip_wait_until(absolute_time_t deadline, volatile bool *flag)
{
	while (!(*flag)) {
		if (time_reached(deadline)) {
			return false;
		}
		sleep_ms(1);
	}
	return true;
}

static bool rp2350_dns_resolve(const char *host, uint32_t timeout_ms, ip_addr_t *out_addr)
{
	rp2350_dns_query_t q;
	err_t err;
	absolute_time_t deadline = make_timeout_time_ms(timeout_ms);

	memset(&q, 0, sizeof(q));

	cyw43_arch_lwip_begin();
	err = dns_gethostbyname(host, &q.addr, rp2350_dns_found_cb, &q);
	cyw43_arch_lwip_end();

	if (err == ERR_OK) {
		*out_addr = q.addr;
		return true;
	}
	if (err != ERR_INPROGRESS) {
		return false;
	}
	if (!rp2350_lwip_wait_until(deadline, &q.done) || !q.ok) {
		return false;
	}
	*out_addr = q.addr;
	return true;
}

static err_t rp2350_tcp_connected_cb(void *arg, struct tcp_pcb *tpcb, err_t err)
{
	rp2350_tcp_ctx_t *ctx = (rp2350_tcp_ctx_t *)arg;
	(void)tpcb;
	if (ctx == NULL) {
		return ERR_OK;
	}
	ctx->last_err = err;
	if (err == ERR_OK) {
		ctx->connected = true;
	} else {
		ctx->had_error = true;
		ctx->done = true;
	}
	return ERR_OK;
}

static err_t rp2350_tcp_recv_cb(void *arg, struct tcp_pcb *tpcb, struct pbuf *p, err_t err)
{
	rp2350_tcp_ctx_t *ctx = (rp2350_tcp_ctx_t *)arg;
	u16_t recved = 0;

	if (ctx == NULL) {
		if (p != NULL) {
			pbuf_free(p);
		}
		return ERR_OK;
	}
	if (err != ERR_OK) {
		ctx->last_err = err;
		ctx->had_error = true;
		ctx->done = true;
		if (p != NULL) {
			pbuf_free(p);
		}
		return ERR_OK;
	}
	if (p == NULL) {
		ctx->done = true;
		return ERR_OK;
	}

	if (ctx->rx_len < ctx->rx_cap) {
		size_t avail = ctx->rx_cap - ctx->rx_len;
		size_t take = (p->tot_len < avail) ? (size_t)p->tot_len : avail;
		if (take < (size_t)p->tot_len) {
			ctx->truncated = true;
		}
		if (take > 0) {
			pbuf_copy_partial(p, ctx->rx + ctx->rx_len, (u16_t)take, 0);
			ctx->rx_len += take;
		}
	} else {
		ctx->truncated = true;
	}

	recved = p->tot_len;
	tcp_recved(tpcb, recved);
	pbuf_free(p);
	return ERR_OK;
}

static void rp2350_tcp_err_cb(void *arg, err_t err)
{
	rp2350_tcp_ctx_t *ctx = (rp2350_tcp_ctx_t *)arg;
	if (ctx == NULL) {
		return;
	}
	ctx->last_err = err;
	ctx->pcb = NULL;
	ctx->had_error = true;
	ctx->done = true;
}

static void rp2350_tcp_ctx_close(rp2350_tcp_ctx_t *ctx)
{
	if (ctx == NULL || ctx->pcb == NULL) {
		return;
	}
	cyw43_arch_lwip_begin();
	tcp_arg(ctx->pcb, NULL);
	tcp_recv(ctx->pcb, NULL);
	tcp_err(ctx->pcb, NULL);
	{
		err_t err = tcp_close(ctx->pcb);
		if (err != ERR_OK) {
			tcp_abort(ctx->pcb);
		}
	}
	cyw43_arch_lwip_end();
	ctx->pcb = NULL;
}

bool rp2350_net_tcp_request(
	const char *host,
	u16_t port,
	const char *payload,
	size_t payload_len,
	uint32_t timeout_ms,
	size_t max_read,
	char **out,
	size_t *out_len
)
{
	ip_addr_t remote;
	rp2350_tcp_ctx_t ctx;
	absolute_time_t deadline;
	size_t off = 0;

	*out = NULL;
	*out_len = 0;

	if (!rp2350_wifi_init_once()) {
		return false;
	}
	if (cyw43_tcpip_link_status(&cyw43_state, CYW43_ITF_STA) != CYW43_LINK_UP) {
		return false;
	}
	if (!rp2350_dns_resolve(host, timeout_ms, &remote)) {
		return false;
	}

