igorwwwwwwwwwwwwwwwwwwww/php-src/sapi/rp2350/src/rp2350_http_stream.c
	memset(&ctx, 0, sizeof(ctx));
	ctx.rx_cap = max_read;
	ctx.rx = (char *)malloc(ctx.rx_cap + 1);
	if (ctx.rx == NULL) {
		return false;
	}

	deadline = make_timeout_time_ms(timeout_ms);

	cyw43_arch_lwip_begin();
	ctx.pcb = tcp_new_ip_type(IP_GET_TYPE(&remote));
	if (ctx.pcb != NULL) {
		tcp_arg(ctx.pcb, &ctx);
		tcp_recv(ctx.pcb, rp2350_tcp_recv_cb);
		tcp_err(ctx.pcb, rp2350_tcp_err_cb);
		ctx.last_err = tcp_connect(ctx.pcb, &remote, port, rp2350_tcp_connected_cb);
		if (ctx.last_err != ERR_OK) {
			tcp_arg(ctx.pcb, NULL);
			tcp_recv(ctx.pcb, NULL);
			tcp_err(ctx.pcb, NULL);
			tcp_abort(ctx.pcb);
			ctx.pcb = NULL;
		}
	}
	cyw43_arch_lwip_end();
	if (ctx.pcb == NULL) {
		free(ctx.rx);
		return false;
	}

	if (!rp2350_lwip_wait_until(deadline, &ctx.connected) || ctx.had_error) {
		rp2350_tcp_ctx_close(&ctx);
		free(ctx.rx);
		return false;
	}

	while (off < payload_len) {
		bool wrote = false;
		cyw43_arch_lwip_begin();
		if (ctx.pcb != NULL) {
			u16_t snd = tcp_sndbuf(ctx.pcb);
			if (snd > 0) {
				u16_t chunk = (u16_t)((payload_len - off) < snd ? (payload_len - off) : snd);
				err_t w = tcp_write(ctx.pcb, payload + off, chunk, TCP_WRITE_FLAG_COPY);
				if (w == ERR_OK) {
					off += chunk;
					(void)tcp_output(ctx.pcb);
					wrote = true;
				} else if (w != ERR_MEM) {
					ctx.had_error = true;
					ctx.last_err = w;
				}
			}
		}
		cyw43_arch_lwip_end();
		if (ctx.had_error || ctx.pcb == NULL) {
			rp2350_tcp_ctx_close(&ctx);
			free(ctx.rx);
			return false;
		}
		if (!wrote) {
			if (time_reached(deadline)) {
				rp2350_tcp_ctx_close(&ctx);
				free(ctx.rx);
				return false;
			}
			sleep_ms(1);
		}
	}

	while (!ctx.done && !ctx.had_error) {
		if (time_reached(deadline)) {
			break;
		}
		sleep_ms(1);
	}

	rp2350_tcp_ctx_close(&ctx);
	ctx.rx[ctx.rx_len] = '\0';
	*out = ctx.rx;
	*out_len = ctx.rx_len;
	return true;
}

typedef struct {
	char *tx;
	size_t tx_len;
	size_t tx_cap;
	size_t tx_off;
	char *body;
	size_t body_len;
	size_t body_cap;
	size_t body_limit;
	bool body_dynamic;
	bool body_truncated;
	int status_code;
	int32_t stream_id;
	bool stream_closed;
	uint32_t stream_error_code;
} rp2350_h2_ctx_t;

static bool rp2350_h2_buf_append(char **buf, size_t *len, size_t *cap, const uint8_t *src, size_t n)
{
	size_t need;
	size_t new_cap;
	char *new_buf;

	if (n == 0) {
		return true;
	}
	need = *len + n;
	if (need <= *cap) {
		memcpy(*buf + *len, src, n);
		*len += n;
		return true;
	}

	new_cap = (*cap == 0) ? 1024 : *cap;
	while (new_cap < need) {
		if (new_cap > (SIZE_MAX / 2)) {
			return false;
		}
		new_cap *= 2;
	}
	new_buf = (char *)realloc(*buf, new_cap);
	if (!new_buf) {
		return false;
	}
	*buf = new_buf;
	*cap = new_cap;
	memcpy(*buf + *len, src, n);
	*len += n;
	return true;
}

static ssize_t rp2350_h2_send_cb(nghttp2_session *session, const uint8_t *data, size_t length, int flags, void *user_data)
{
	rp2350_h2_ctx_t *ctx = (rp2350_h2_ctx_t *)user_data;
	(void)session;
	(void)flags;
	if (!rp2350_h2_buf_append(&ctx->tx, &ctx->tx_len, &ctx->tx_cap, data, length)) {
		return NGHTTP2_ERR_CALLBACK_FAILURE;
	}
	return (ssize_t)length;
}

static int rp2350_h2_on_header_cb(nghttp2_session *session, const nghttp2_frame *frame, const uint8_t *name, size_t namelen, const uint8_t *value, size_t valuelen, uint8_t flags, void *user_data)
{
	rp2350_h2_ctx_t *ctx = (rp2350_h2_ctx_t *)user_data;
	(void)session;
	(void)flags;

	if (frame->hd.type != NGHTTP2_HEADERS || frame->headers.cat != NGHTTP2_HCAT_RESPONSE) {
		return 0;
	}
	if (frame->hd.stream_id != ctx->stream_id) {
		return 0;
	}
	if (namelen == 7 && memcmp(name, ":status", 7) == 0) {
		char tmp[4];
		size_t n = (valuelen < sizeof(tmp) - 1) ? valuelen : (sizeof(tmp) - 1);
		memcpy(tmp, value, n);
		tmp[n] = '\0';
		ctx->status_code = atoi(tmp);
	}
	return 0;
}

static int rp2350_h2_on_data_chunk_recv_cb(nghttp2_session *session, uint8_t flags, int32_t stream_id, const uint8_t *data, size_t len, void *user_data)
{
	rp2350_h2_ctx_t *ctx = (rp2350_h2_ctx_t *)user_data;
	size_t avail;
	size_t take;
	(void)session;
	(void)flags;

	if (stream_id != ctx->stream_id || len == 0) {
		return 0;
	}

	if (ctx->body_dynamic) {
		if (ctx->body_limit > 0 && ctx->body_len >= ctx->body_limit) {
			ctx->body_truncated = true;
			return 0;
		}
		take = len;
		if (ctx->body_limit > 0) {
			size_t remain = ctx->body_limit - ctx->body_len;
			if (take > remain) {
				take = remain;
				ctx->body_truncated = true;
			}
		}
		if (take > 0 && !rp2350_h2_buf_append(&ctx->body, &ctx->body_len, &ctx->body_cap, data, take)) {
			return NGHTTP2_ERR_CALLBACK_FAILURE;
		}
		return 0;
	}

	if (ctx->body_len >= ctx->body_cap) {
		ctx->body_truncated = true;
		return 0;
	}

	avail = ctx->body_cap - ctx->body_len;
	take = (len < avail) ? len : avail;
	if (take < len) {
		ctx->body_truncated = true;
	}
	memcpy(ctx->body + ctx->body_len, data, take);
	ctx->body_len += take;
	return 0;
}

static int rp2350_h2_on_stream_close_cb(nghttp2_session *session, int32_t stream_id, uint32_t error_code, void *user_data)
{
	rp2350_h2_ctx_t *ctx = (rp2350_h2_ctx_t *)user_data;
	(void)session;
	if (ctx && stream_id == ctx->stream_id) {
		ctx->stream_closed = true;
		ctx->stream_error_code = error_code;
	}
	return 0;
}

static bool rp2350_h2_flush_tx(rp2350_h2_ctx_t *h2, rp2350_altcp_ctx_t *net, absolute_time_t deadline)
{
	while (h2->tx_off < h2->tx_len) {
		bool progressed = false;
		cyw43_arch_lwip_begin();
		if (net->pcb != NULL) {
			u16_t snd = altcp_sndbuf(net->pcb);
			if (snd > 0) {
				size_t rem = h2->tx_len - h2->tx_off;
				u16_t chunk = (u16_t)(rem < snd ? rem : snd);
				err_t w = altcp_write(net->pcb, h2->tx + h2->tx_off, chunk, TCP_WRITE_FLAG_COPY);
				if (w == ERR_OK) {
					h2->tx_off += chunk;
					(void)altcp_output(net->pcb);
					progressed = true;
				} else if (w != ERR_MEM) {
					net->had_error = true;
					net->last_err = w;
				}
			}
		}
		cyw43_arch_lwip_end();

		if (net->had_error || net->pcb == NULL) {
			return false;
		}
		if (!progressed) {
			if (time_reached(deadline)) {
				return false;
			}
			sleep_ms(1);
		}
	}

	h2->tx_len = 0;
	h2->tx_off = 0;
	return true;
}

