igorwwwwwwwwwwwwwwwwwwww/php-src/sapi/rp2350/src/rp2350_http_stream.c
typedef struct {
	struct altcp_tls_config *config;
	const char *hostname;
} rp2350_h2_tls_alloc_ctx_t;

static struct altcp_pcb *rp2350_h2_tls_alloc_with_sni(void *arg, u8_t ip_type)
{
	rp2350_h2_tls_alloc_ctx_t *ctx = (rp2350_h2_tls_alloc_ctx_t *)arg;
	struct altcp_pcb *pcb;

	if (!ctx || !ctx->config) {
		return NULL;
	}

	pcb = altcp_tls_alloc(ctx->config, ip_type);
	if (!pcb) {
		return NULL;
	}

	if (ctx->hostname && ctx->hostname[0] != '\0') {
		void *tls = altcp_tls_context(pcb);
		if (tls) {
			(void)mbedtls_ssl_set_hostname((mbedtls_ssl_context *)tls, ctx->hostname);
		}
	}
	return pcb;
}

static err_t rp2350_h2_altcp_connected_cb(void *arg, struct altcp_pcb *conn, err_t err)
{
	rp2350_altcp_ctx_t *ctx = (rp2350_altcp_ctx_t *)arg;
	(void)conn;
	if (!ctx) {
		return ERR_ARG;
	}
	if (err == ERR_OK) {
		ctx->connected = true;
	} else {
		ctx->had_error = true;
		ctx->last_err = err;
		ctx->done = true;
	}
	return ERR_OK;
}

static err_t rp2350_h2_altcp_recv_cb(void *arg, struct altcp_pcb *conn, struct pbuf *p, err_t err)
{
	rp2350_altcp_ctx_t *ctx = (rp2350_altcp_ctx_t *)arg;
	size_t avail;
	size_t take;
	u16_t recvd;

	if (!ctx) {
		if (p) {
			pbuf_free(p);
		}
		return ERR_OK;
	}
	if (err != ERR_OK) {
		if (p) {
			pbuf_free(p);
		}
		ctx->had_error = true;
		ctx->last_err = err;
		ctx->done = true;
		return err;
	}
	if (!p) {
		ctx->done = true;
		return ERR_OK;
	}

	if (ctx->rx_len < ctx->rx_cap) {
		avail = ctx->rx_cap - ctx->rx_len;
		take = (p->tot_len < avail) ? (size_t)p->tot_len : avail;
		if (take < (size_t)p->tot_len) {
			ctx->truncated = true;
		}
		if (take > 0) {
			pbuf_copy_partial(p, ctx->rx + ctx->rx_len, (u16_t)take, 0);
			ctx->rx_len += take;
		}
	} else {
		ctx->truncated = true;
	}

	recvd = p->tot_len;
	altcp_recved(conn, recvd);
	pbuf_free(p);
	ctx->last_rx_time = get_absolute_time();
	return ERR_OK;
}

static void rp2350_h2_altcp_err_cb(void *arg, err_t err)
{
	rp2350_altcp_ctx_t *ctx = (rp2350_altcp_ctx_t *)arg;
	if (!ctx) {
		return;
	}
	ctx->last_err = err;
	ctx->pcb = NULL;
	ctx->had_error = true;
	ctx->done = true;
}

static void rp2350_h2_altcp_close(rp2350_altcp_ctx_t *ctx)
{
	if (!ctx || !ctx->pcb) {
		return;
	}
	cyw43_arch_lwip_begin();
	altcp_arg(ctx->pcb, NULL);
	altcp_recv(ctx->pcb, NULL);
	altcp_err(ctx->pcb, NULL);
	{
		err_t err = altcp_close(ctx->pcb);
		if (err != ERR_OK) {
			altcp_abort(ctx->pcb);
		}
	}
	cyw43_arch_lwip_end();
	ctx->pcb = NULL;
}

static bool rp2350_net_tls_request(
	const char *host,
	u16_t port,
	const char *payload,
	size_t payload_len,
	uint32_t timeout_ms,
	size_t max_read,
	char **out,
	size_t *out_len
)
{
	ip_addr_t remote;
	rp2350_altcp_ctx_t ctx;
	absolute_time_t deadline;
	size_t off = 0;
	rp2350_h2_tls_alloc_ctx_t tls_ctx;
	altcp_allocator_t tls_allocator;

	*out = NULL;
	*out_len = 0;

	if (!rp2350_wifi_init_once()) {
		return false;
	}
	if (cyw43_tcpip_link_status(&cyw43_state, CYW43_ITF_STA) != CYW43_LINK_UP) {
		return false;
	}
	if (!rp2350_h2_tls_config_ready()) {
		return false;
	}
	if (!rp2350_dns_resolve(host, timeout_ms, &remote)) {
		return false;
	}

	memset(&ctx, 0, sizeof(ctx));
	ctx.rx_cap = max_read;
	ctx.rx = (char *)malloc(max_read + 1);
	if (!ctx.rx) {
		return false;
	}
	ctx.last_rx_time = get_absolute_time();

	tls_ctx.config = s_h2_tls_config;
	tls_ctx.hostname = host;
	tls_allocator.alloc = rp2350_h2_tls_alloc_with_sni;
	tls_allocator.arg = &tls_ctx;
	deadline = make_timeout_time_ms(timeout_ms);

	cyw43_arch_lwip_begin();
	ctx.pcb = altcp_new_ip_type(&tls_allocator, IP_GET_TYPE(&remote));
	if (ctx.pcb != NULL) {
		altcp_arg(ctx.pcb, &ctx);
		altcp_recv(ctx.pcb, rp2350_h2_altcp_recv_cb);
		altcp_err(ctx.pcb, rp2350_h2_altcp_err_cb);
		ctx.last_err = altcp_connect(ctx.pcb, &remote, port, rp2350_h2_altcp_connected_cb);
		if (ctx.last_err != ERR_OK) {
			altcp_arg(ctx.pcb, NULL);
			altcp_recv(ctx.pcb, NULL);
			altcp_err(ctx.pcb, NULL);
			altcp_abort(ctx.pcb);
			ctx.pcb = NULL;
		}
	}
	cyw43_arch_lwip_end();
	if (ctx.pcb == NULL) {
		free(ctx.rx);
		return false;
	}

	if (!rp2350_lwip_wait_until(deadline, &ctx.connected) || ctx.had_error) {
		rp2350_h2_altcp_close(&ctx);
		free(ctx.rx);
		return false;
	}

	while (off < payload_len) {
		bool wrote = false;
		cyw43_arch_lwip_begin();
		if (ctx.pcb != NULL) {
			u16_t snd = altcp_sndbuf(ctx.pcb);
			if (snd > 0) {
				u16_t chunk = (u16_t)((payload_len - off) < snd ? (payload_len - off) : snd);
				err_t w = altcp_write(ctx.pcb, payload + off, chunk, TCP_WRITE_FLAG_COPY);
				if (w == ERR_OK) {
					off += chunk;
					(void)altcp_output(ctx.pcb);
					wrote = true;
				} else if (w != ERR_MEM) {
					ctx.had_error = true;
					ctx.last_err = w;
				}
			}
		}
		cyw43_arch_lwip_end();
		if (ctx.had_error || ctx.pcb == NULL) {
			rp2350_h2_altcp_close(&ctx);
			free(ctx.rx);
			return false;
		}
		if (!wrote) {
			if (time_reached(deadline)) {
				rp2350_h2_altcp_close(&ctx);
				free(ctx.rx);
				return false;
			}
			sleep_ms(1);
		}
	}

	/* Signal end-of-request bytes so the peer can finish and close promptly. */
	cyw43_arch_lwip_begin();
	if (ctx.pcb != NULL) {
		(void)altcp_shutdown(ctx.pcb, 0, 1);
	}
	cyw43_arch_lwip_end();

	while (!ctx.done && !ctx.had_error) {
		if (time_reached(deadline)) {
			break;
		}
		sleep_ms(1);
	}

	rp2350_h2_altcp_close(&ctx);
	ctx.rx[ctx.rx_len] = '\0';
	*out = ctx.rx;
	*out_len = ctx.rx_len;
	return true;
}

static bool rp2350_h2_get_body_ex(
	const char *url,
	uint32_t timeout_ms,
	size_t max_read,
	char **body_out,
	size_t *body_len_out,
	bool *alpn_http1_out
)
{
	char host[96];
	u16_t port;
	const char *path;
	bool is_https = false;
	rp2350_h2_ctx_t ctx;
	rp2350_altcp_ctx_t net;
	ip_addr_t remote;
	rp2350_h2_tls_alloc_ctx_t tls_ctx;
	altcp_allocator_t tls_allocator;
	absolute_time_t deadline;
	nghttp2_session_callbacks *callbacks = NULL;
	nghttp2_session *session = NULL;
	nghttp2_nv nva[5];
	size_t parsed_off;
	size_t rx_cap;
	ssize_t parsed;
	int rc;
	const char *alpn = NULL;
	bool ok = false;

	*body_out = NULL;
	*body_len_out = 0;
	if (alpn_http1_out) {
		*alpn_http1_out = false;
	}

	if (!rp2350_parse_http_url(url, host, sizeof(host), &port, &path, &is_https)) {
		php_error_docref(NULL, E_WARNING, "h2 url parse failed: %s", url ? url : "<null>");
		return false;
	}
	if (!is_https) {
		php_error_docref(NULL, E_WARNING, "h2 get currently requires https:// with ALPN h2");
		return false;
	}
	if (max_read < 1) {
		max_read = 1;
	} else if (max_read > 262144) {
		max_read = 262144;
	}
	if (!rp2350_wifi_init_once()) {
		php_error_docref(NULL, E_WARNING, "h2 wifi init failed");
		return false;
	}
	if (cyw43_tcpip_link_status(&cyw43_state, CYW43_ITF_STA) != CYW43_LINK_UP) {
		php_error_docref(NULL, E_WARNING, "h2 wifi not connected");
		return false;
	}
	if (!rp2350_h2_tls_config_ready()) {
		php_error_docref(NULL, E_WARNING, "h2 tls config not ready");
		return false;
	}
	if (!rp2350_dns_resolve(host, timeout_ms, &remote)) {
		php_error_docref(NULL, E_WARNING, "h2 dns resolve failed: host=%s", host);
		return false;
	}

