igorwwwwwwwwwwwwwwwwwwww/php-src/sapi/rp2350/src/rp2350_http_stream.c
	memset(&ctx, 0, sizeof(ctx));
	memset(&net, 0, sizeof(net));
	ctx.body = (char *)malloc(max_read + 1);
	if (!ctx.body) {
		php_error_docref(NULL, E_WARNING, "h2 body alloc failed: cap=%u", (unsigned)max_read);
		return false;
	}
	ctx.body_cap = max_read;
	ctx.body_limit = max_read;
	ctx.body_dynamic = false;
	rx_cap = max_read + 32768;
	net.rx = (char *)malloc(rx_cap + 1);
	if (!net.rx) {
		php_error_docref(NULL, E_WARNING, "h2 rx alloc failed: cap=%u", (unsigned)rx_cap);
		free(ctx.body);
		return false;
	}
	net.rx_cap = rx_cap;
	net.last_rx_time = get_absolute_time();
	parsed_off = 0;

	rc = nghttp2_session_callbacks_new(&callbacks);
	if (rc != 0) {
		php_error_docref(NULL, E_WARNING, "h2 callbacks alloc failed: %d", rc);
		goto cleanup;
	}
	nghttp2_session_callbacks_set_send_callback(callbacks, rp2350_h2_send_cb);
	nghttp2_session_callbacks_set_on_header_callback(callbacks, rp2350_h2_on_header_cb);
	nghttp2_session_callbacks_set_on_data_chunk_recv_callback(callbacks, rp2350_h2_on_data_chunk_recv_cb);
	nghttp2_session_callbacks_set_on_stream_close_callback(callbacks, rp2350_h2_on_stream_close_cb);

	rc = nghttp2_session_client_new(&session, callbacks, &ctx);
	if (rc != 0) {
		php_error_docref(NULL, E_WARNING, "h2 session alloc failed: %d", rc);
		goto cleanup;
	}

	rc = nghttp2_submit_settings(session, NGHTTP2_FLAG_NONE, NULL, 0);
	if (rc != 0) {
		php_error_docref(NULL, E_WARNING, "h2 submit settings failed: %d", rc);
		goto cleanup;
	}

	memset(nva, 0, sizeof(nva));
	nva[0].name = (uint8_t *)":method";
	nva[0].value = (uint8_t *)"GET";
	nva[0].namelen = sizeof(":method") - 1;
	nva[0].valuelen = sizeof("GET") - 1;
	nva[1].name = (uint8_t *)":scheme";
	nva[1].value = (uint8_t *)"https";
	nva[1].namelen = sizeof(":scheme") - 1;
	nva[1].valuelen = sizeof("https") - 1;
	nva[2].name = (uint8_t *)":authority";
	nva[2].value = (uint8_t *)host;
	nva[2].namelen = sizeof(":authority") - 1;
	nva[2].valuelen = strlen(host);
	nva[3].name = (uint8_t *)":path";
	nva[3].value = (uint8_t *)path;
	nva[3].namelen = sizeof(":path") - 1;
	nva[3].valuelen = strlen(path);
	nva[4].name = (uint8_t *)"user-agent";
	nva[4].value = (uint8_t *)"rp2350-nghttp2";
	nva[4].namelen = sizeof("user-agent") - 1;
	nva[4].valuelen = sizeof("rp2350-nghttp2") - 1;

	ctx.stream_id = nghttp2_submit_request(session, NULL, nva, 5, NULL, NULL);
	if (ctx.stream_id < 0) {
		php_error_docref(NULL, E_WARNING, "h2 submit request failed: %d", (int)ctx.stream_id);
		goto cleanup;
	}

	rc = nghttp2_session_send(session);
	if (rc != 0) {
		php_error_docref(NULL, E_WARNING, "h2 encode failed: %d", rc);
		goto cleanup;
	}

	tls_ctx.config = s_h2_tls_config;
	tls_ctx.hostname = host;
	tls_allocator.alloc = rp2350_h2_tls_alloc_with_sni;
	tls_allocator.arg = &tls_ctx;
	deadline = make_timeout_time_ms(timeout_ms);

	cyw43_arch_lwip_begin();
	net.pcb = altcp_new_ip_type(&tls_allocator, IP_GET_TYPE(&remote));
	if (net.pcb != NULL) {
		altcp_arg(net.pcb, &net);
		altcp_recv(net.pcb, rp2350_h2_altcp_recv_cb);
		altcp_err(net.pcb, rp2350_h2_altcp_err_cb);
		net.last_err = altcp_connect(net.pcb, &remote, port, rp2350_h2_altcp_connected_cb);
		if (net.last_err != ERR_OK) {
			altcp_arg(net.pcb, NULL);
			altcp_recv(net.pcb, NULL);
			altcp_err(net.pcb, NULL);
			altcp_abort(net.pcb);
			net.pcb = NULL;
		}
	}
	cyw43_arch_lwip_end();
	if (net.pcb == NULL) {
		php_error_docref(NULL, E_WARNING, "h2 connect alloc/connect failed");
		goto cleanup;
	}
	if (!rp2350_lwip_wait_until(deadline, &net.connected) || net.had_error) {
		php_error_docref(NULL, E_WARNING, "h2 connect timeout/error: lwip=%d", (int)net.last_err);
		goto cleanup;
	}

	cyw43_arch_lwip_begin();
	if (net.pcb != NULL) {
		void *tls = altcp_tls_context(net.pcb);
		if (tls != NULL) {
			alpn = mbedtls_ssl_get_alpn_protocol((mbedtls_ssl_context *)tls);
		}
	}
	cyw43_arch_lwip_end();
	if (alpn == NULL || strcmp(alpn, "h2") != 0) {
		if (alpn_http1_out && alpn && strcmp(alpn, "http/1.1") == 0) {
			*alpn_http1_out = true;
		} else {
			php_error_docref(NULL, E_WARNING, "h2 ALPN negotiation failed: got=%s", alpn ? alpn : "<null>");
		}
		goto cleanup;
	}

	while (!time_reached(deadline) && !net.had_error && !ctx.stream_closed) {
		if (!rp2350_h2_flush_tx(&ctx, &net, deadline)) {
			break;
		}
		if (net.rx_len > parsed_off) {
			parsed = nghttp2_session_mem_recv(
				session,
				(const uint8_t *)(net.rx + parsed_off),
				net.rx_len - parsed_off
			);
			if (parsed < 0) {
				php_error_docref(NULL, E_WARNING, "h2 parse failed: %s", nghttp2_strerror((int)parsed));
				goto cleanup;
			}
			parsed_off += (size_t)parsed;

			rc = nghttp2_session_send(session);
			if (rc != 0) {
				php_error_docref(NULL, E_WARNING, "h2 session_send failed: %d", rc);
				goto cleanup;
			}
			continue;
		}
		sleep_ms(1);
	}

	if (net.had_error) {
		php_error_docref(NULL, E_WARNING, "h2 transport error: lwip=%d", (int)net.last_err);
		goto cleanup;
	}
	if (ctx.status_code <= 0) {
		char preview[49];
		size_t n = net.rx_len < 48 ? net.rx_len : 48;
		size_t i;
		for (i = 0; i < n; i++) {
			char c = net.rx[i];
			preview[i] = (c >= 32 && c <= 126) ? c : '.';
		}
		preview[n] = '\0';
		php_error_docref(
			NULL,
			E_WARNING,
			"h2 response missing :status (rx=%u parsed=%u stream_id=%d stream_closed=%d stream_err=0x%x body=%u head=\"%s\")",
			(unsigned)net.rx_len,
			(unsigned)parsed_off,
			(int)ctx.stream_id,
			ctx.stream_closed ? 1 : 0,
			(unsigned)ctx.stream_error_code,
			(unsigned)ctx.body_len,
			preview
		);
		goto cleanup;
	}
	if (ctx.status_code < 200 || ctx.status_code >= 300) {
		php_error_docref(NULL, E_WARNING, "h2 status=%d", ctx.status_code);
		goto cleanup;
	}
	if (ctx.body_len == 0) {
		php_error_docref(NULL, E_WARNING, "h2 empty body: status=%d parsed=%u rx=%u stream_closed=%d",
			ctx.status_code,
			(unsigned)parsed_off,
			(unsigned)net.rx_len,
			ctx.stream_closed ? 1 : 0);
		goto cleanup;
	}
	if (ctx.body_truncated) {
		php_error_docref(NULL, E_WARNING, "h2 body truncated: cap=%u", (unsigned)max_read);
	}

