igorwwwwwwwwwwwwwwwwwwww/php-src/sapi/rp2350/src/rp2350_http_stream.c
	ctx.body[ctx.body_len] = '\0';
	*body_out = ctx.body;
	*body_len_out = ctx.body_len;
	ctx.body = NULL;
	ok = true;

cleanup:
	if (net.pcb != NULL) {
		rp2350_h2_altcp_close(&net);
	}
	free(net.rx);
	nghttp2_session_del(session);
	nghttp2_session_callbacks_del(callbacks);
	free(ctx.tx);
	if (ctx.body != NULL) {
		free(ctx.body);
	}
	return ok;
}

static bool rp2350_h2_get_body(const char *url, uint32_t timeout_ms, size_t max_read, char **body_out, size_t *body_len_out)
{
	return rp2350_h2_get_body_ex(url, timeout_ms, max_read, body_out, body_len_out, NULL);
}

static bool rp2350_parse_http_url(const char *url, char *host, size_t host_size, u16_t *port, const char **path, bool *is_https)
{
	const char *p;
	const char *host_start;
	size_t host_len;
	unsigned long parsed_port = 80;
	char *endptr;

	if (strncmp(url, "http://", 7) == 0) {
		p = url + 7;
		*is_https = false;
		parsed_port = 80;
	} else if (strncmp(url, "https://", 8) == 0) {
		p = url + 8;
		*is_https = true;
		parsed_port = 443;
	} else {
		return false;
	}
	host_start = p;
	while (*p && *p != '/' && *p != ':') {
		p++;
	}
	if (p == host_start) {
		return false;
	}

	host_len = (size_t)(p - host_start);
	if (host_len + 1 > host_size) {
		return false;
	}
	memcpy(host, host_start, host_len);
	host[host_len] = '\0';

	if (*p == ':') {
		const char *port_start = p + 1;
		while (*p && *p != '/') {
			p++;
		}
		{
			size_t n = (size_t)(p - port_start);
			char tmp[8];
			if (n == 0 || n >= sizeof(tmp)) {
				return false;
			}
			memcpy(tmp, port_start, n);
			tmp[n] = '\0';
			parsed_port = strtoul(tmp, &endptr, 10);
			if (*endptr != '\0' || parsed_port == 0 || parsed_port > 65535) {
				return false;
			}
		}
	}

	*port = (u16_t)parsed_port;
	*path = (*p == '/') ? p : "/";
	return true;
}

typedef struct {
	struct altcp_tls_config *config;
	const char *hostname;
} rp2350_tls_alloc_ctx_t;

static struct altcp_pcb *rp2350_altcp_tls_alloc_with_sni(void *arg, u8_t ip_type)
{
	rp2350_tls_alloc_ctx_t *ctx = (rp2350_tls_alloc_ctx_t *)arg;
	struct altcp_pcb *pcb;

	if (!ctx || !ctx->config) {
		return NULL;
	}

	pcb = altcp_tls_alloc(ctx->config, ip_type);
	if (!pcb) {
		return NULL;
	}

	if (ctx->hostname && ctx->hostname[0] != '\0') {
		void *tls = altcp_tls_context(pcb);
		if (tls) {
			int rc = mbedtls_ssl_set_hostname((mbedtls_ssl_context *)tls, ctx->hostname);
			if (rc != 0) {
				php_error_docref(NULL, E_WARNING, "https SNI setup failed for host=%s mbedtls=%d", ctx->hostname, rc);
			}
		}
	}

	return pcb;
}

static bool rp2350_http_build_get_request(const char *host, const char *path, char **req_out, size_t *req_len_out)
{
	int n;
	char *req;

	n = snprintf(
		NULL,
		0,
		"GET %s HTTP/1.1\r\nHost: %s\r\nConnection: close\r\nUser-Agent: rp2350-php\r\nAccept: */*\r\n\r\n",
		path,
		host
	);
	if (n <= 0) {
		return false;
	}
	req = (char *)malloc((size_t)n + 1);
	if (!req) {
		return false;
	}
	snprintf(
		req,
		(size_t)n + 1,
		"GET %s HTTP/1.1\r\nHost: %s\r\nConnection: close\r\nUser-Agent: rp2350-php\r\nAccept: */*\r\n\r\n",
		path,
		host
	);
	*req_out = req;
	*req_len_out = (size_t)n;
	return true;
}

static bool rp2350_http_h1_extract_body(
	const char *resp,
	size_t resp_len,
	size_t max_read,
	char **body_out,
	size_t *body_len_out
)
{
	int minor_version = 0;
	int status = 0;
	const char *msg = NULL;
	size_t msg_len = 0;
	struct phr_header headers[48];
	size_t num_headers = sizeof(headers) / sizeof(headers[0]);
	int parsed;
	char *body;
	size_t body_len;

	*body_out = NULL;
	*body_len_out = 0;
	parsed = phr_parse_response(
		resp,
		resp_len,
		&minor_version,
		&status,
		&msg,
		&msg_len,
		headers,
		&num_headers,
		0
	);
	if (parsed <= 0) {
		php_error_docref(NULL, E_WARNING, "http parse failed: parsed=%d", parsed);
		return false;
	}
	if (status < 100 || status > 599) {
		php_error_docref(NULL, E_WARNING, "http parse status invalid: %d", status);
		return false;
	}
	body_len = resp_len - (size_t)parsed;
	if (body_len > max_read) {
		body_len = max_read;
	}
	body = (char *)malloc(body_len + 1);
	if (!body) {
		return false;
	}
	memcpy(body, resp + parsed, body_len);
	body[body_len] = '\0';
	*body_out = body;
	*body_len_out = body_len;
	return true;
}

static bool rp2350_net_tls_request_http1(
	const char *host,
	u16_t port,
	const char *payload,
	size_t payload_len,
	uint32_t timeout_ms,
	size_t max_read,
	char **out,
	size_t *out_len
)
{
	ip_addr_t remote;
	rp2350_altcp_ctx_t ctx;
	absolute_time_t deadline;
	size_t off = 0;
	altcp_allocator_t tls_allocator;
	rp2350_tls_alloc_ctx_t tls_ctx;

	*out = NULL;
	*out_len = 0;

	if (!rp2350_wifi_init_once()) {
		return false;
	}
	if (cyw43_tcpip_link_status(&cyw43_state, CYW43_ITF_STA) != CYW43_LINK_UP) {
		return false;
	}
	if (!rp2350_http_tls_config_ready()) {
		return false;
	}
	if (!rp2350_dns_resolve(host, timeout_ms, &remote)) {
		return false;
	}

	memset(&ctx, 0, sizeof(ctx));
	ctx.rx_cap = max_read;
	ctx.rx = (char *)malloc(ctx.rx_cap + 1);
	if (ctx.rx == NULL) {
		return false;
	}
	ctx.last_rx_time = get_absolute_time();

	tls_ctx.config = s_http_tls_config;
	tls_ctx.hostname = host;
	tls_allocator.alloc = rp2350_altcp_tls_alloc_with_sni;
	tls_allocator.arg = &tls_ctx;
	deadline = make_timeout_time_ms(timeout_ms);

	cyw43_arch_lwip_begin();
	ctx.pcb = altcp_new_ip_type(&tls_allocator, IP_GET_TYPE(&remote));
	if (ctx.pcb != NULL) {
		altcp_arg(ctx.pcb, &ctx);
		altcp_recv(ctx.pcb, rp2350_h2_altcp_recv_cb);
		altcp_err(ctx.pcb, rp2350_h2_altcp_err_cb);
		ctx.last_err = altcp_connect(ctx.pcb, &remote, port, rp2350_h2_altcp_connected_cb);
		if (ctx.last_err != ERR_OK) {
			altcp_arg(ctx.pcb, NULL);
			altcp_recv(ctx.pcb, NULL);
			altcp_err(ctx.pcb, NULL);
			altcp_abort(ctx.pcb);
			ctx.pcb = NULL;
		}
	}
	cyw43_arch_lwip_end();
	if (ctx.pcb == NULL) {
		free(ctx.rx);
		return false;
	}

	if (!rp2350_lwip_wait_until(deadline, &ctx.connected) || ctx.had_error) {
		rp2350_h2_altcp_close(&ctx);
		free(ctx.rx);
		return false;
	}

	while (off < payload_len) {
		bool wrote = false;
		cyw43_arch_lwip_begin();
		if (ctx.pcb != NULL) {
			u16_t snd = altcp_sndbuf(ctx.pcb);
			if (snd > 0) {
				u16_t chunk = (u16_t)((payload_len - off) < snd ? (payload_len - off) : snd);
				err_t w = altcp_write(ctx.pcb, payload + off, chunk, TCP_WRITE_FLAG_COPY);
				if (w == ERR_OK) {
					off += chunk;
					(void)altcp_output(ctx.pcb);
					wrote = true;
				} else if (w != ERR_MEM) {
					ctx.had_error = true;
					ctx.last_err = w;
				}
			}
		}
		cyw43_arch_lwip_end();
		if (ctx.had_error || ctx.pcb == NULL) {
			rp2350_h2_altcp_close(&ctx);
			free(ctx.rx);
			return false;
		}
		if (!wrote) {
			if (time_reached(deadline)) {
				rp2350_h2_altcp_close(&ctx);
				free(ctx.rx);
				return false;
			}
			sleep_ms(1);
		}
	}

	cyw43_arch_lwip_begin();
	if (ctx.pcb != NULL) {
		(void)altcp_shutdown(ctx.pcb, 0, 1);
	}
	cyw43_arch_lwip_end();

