igorwwwwwwwwwwwwwwwwwwww/php-src/sapi/rp2350/src/rp2350_http_stream.c
	while (!ctx.done && !ctx.had_error) {
		if (time_reached(deadline)) {
			break;
		}
		sleep_ms(1);
	}

	rp2350_h2_altcp_close(&ctx);
	ctx.rx[ctx.rx_len] = '\0';
	*out = ctx.rx;
	*out_len = ctx.rx_len;
	return true;
}

bool rp2350_http_get_body(const char *url, uint32_t timeout_ms, size_t max_read, char **body_out, size_t *body_len_out)
{
	char host[96];
	u16_t port;
	const char *path;
	bool is_https = false;
	char *request = NULL;
	size_t request_len = 0;
	char *response = NULL;
	size_t response_len = 0;
	bool h2_alpn_http1 = false;

	*body_out = NULL;
	*body_len_out = 0;

	if (!rp2350_parse_http_url(url, host, sizeof(host), &port, &path, &is_https)) {
		php_error_docref(NULL, E_WARNING, "http url parse failed: %s", url ? url : "<null>");
		return false;
	}

	if (is_https) {
		if (rp2350_h2_get_body_ex(url, timeout_ms, max_read, body_out, body_len_out, &h2_alpn_http1)) {
			return true;
		}
		if (!h2_alpn_http1) {
			return false;
		}
	}

	if (!rp2350_http_build_get_request(host, path, &request, &request_len)) {
		php_error_docref(NULL, E_WARNING, "http request build failed");
		return false;
	}

	if (is_https) {
		if (!rp2350_net_tls_request_http1(host, port, request, request_len, timeout_ms, max_read + 8192, &response, &response_len)) {
			free(request);
			return false;
		}
	} else {
		if (!rp2350_net_tcp_request(host, port, request, request_len, timeout_ms, max_read + 8192, &response, &response_len)) {
			free(request);
			return false;
		}
	}
	free(request);

	if (!rp2350_http_h1_extract_body(response, response_len, max_read, body_out, body_len_out)) {
		free(response);
		return false;
	}
	free(response);
	return true;
}

typedef enum {
	RP2350_HTTP_STREAM_MODE_H1 = 0,
	RP2350_HTTP_STREAM_MODE_H2 = 1,
} rp2350_http_stream_mode_t;

typedef struct {
	rp2350_altcp_ctx_t net;
	uint32_t timeout_ms;
	rp2350_http_stream_mode_t mode;
	bool headers_done;
	bool response_parsed;
	nghttp2_session_callbacks *h2_callbacks;
	nghttp2_session *h2_session;
	rp2350_h2_ctx_t h2;
} rp2350_http_stream_data_t;

static ssize_t rp2350_http_stream_write(php_stream *stream, const char *buf, size_t count)
{
	(void)stream;
	(void)buf;
	(void)count;
	return -1;
}

static ssize_t rp2350_http_stream_read(php_stream *stream, char *buf, size_t count)
{
	rp2350_http_stream_data_t *st = (rp2350_http_stream_data_t *)stream->abstract;
	absolute_time_t deadline;

	if (!st || count == 0) {
		return 0;
	}

	deadline = make_timeout_time_ms(st->timeout_ms);

	if (st->mode == RP2350_HTTP_STREAM_MODE_H2) {
		while (true) {
			bool done = false;
			bool had_error = false;
			ssize_t parsed = 0;

			if (st->h2.body_len > 0) {
				size_t take = (count < st->h2.body_len) ? count : st->h2.body_len;
				memcpy(buf, st->h2.body, take);
				if (take < st->h2.body_len) {
					memmove(st->h2.body, st->h2.body + take, st->h2.body_len - take);
				}
				st->h2.body_len -= take;
				return (ssize_t)take;
			}
			if (st->h2.stream_closed) {
				stream->eof = 1;
				return 0;
			}

			cyw43_arch_lwip_begin();
			done = st->net.done;
			had_error = st->net.had_error;
			if (st->net.rx_len > 0) {
				parsed = nghttp2_session_mem_recv(
					st->h2_session,
					(const uint8_t *)st->net.rx,
					st->net.rx_len
				);
				if (parsed >= 0) {
					size_t used = (size_t)parsed;
					if (used < st->net.rx_len) {
						memmove(st->net.rx, st->net.rx + used, st->net.rx_len - used);
					}
					st->net.rx_len -= used;
				}
			}
			cyw43_arch_lwip_end();

			if (parsed < 0) {
				stream->eof = 1;
				return 0;
			}
			if (had_error || done) {
				stream->eof = 1;
				return 0;
			}

			if (parsed > 0) {
				int rc = nghttp2_session_send(st->h2_session);
				if (rc != 0) {
					stream->eof = 1;
					return 0;
				}
				if (!rp2350_h2_flush_tx(&st->h2, &st->net, deadline)) {
					stream->eof = 1;
					return 0;
				}
				continue;
			}

			if (time_reached(deadline)) {
				stream->eof = 1;
				return 0;
			}
			sleep_ms(1);
		}
	}

	while (true) {
		size_t rx_len = 0;
		bool done = false;
		bool had_error = false;

		cyw43_arch_lwip_begin();
		rx_len = st->net.rx_len;
		done = st->net.done;
		had_error = st->net.had_error;

		if (!st->headers_done && rx_len > 0) {
			size_t i;
			size_t parsed = 0;
			for (i = 0; i + 3 < rx_len; i++) {
				if (st->net.rx[i] == '\r' && st->net.rx[i + 1] == '\n' && st->net.rx[i + 2] == '\r' && st->net.rx[i + 3] == '\n') {
					parsed = i + 4;
					break;
				}
			}
			if (parsed > 0) {
				if (!st->response_parsed) {
					int minor_version = 0;
					int status = 0;
					const char *msg = NULL;
					size_t msg_len = 0;
					struct phr_header headers[48];
					size_t num_headers = sizeof(headers) / sizeof(headers[0]);
					int rc = phr_parse_response(
						st->net.rx,
						parsed,
						&minor_version,
						&status,
						&msg,
						&msg_len,
						headers,
						&num_headers,
						0
					);
					if (rc <= 0) {
						st->net.had_error = true;
						cyw43_arch_lwip_end();
						stream->eof = 1;
						return 0;
					}
					st->response_parsed = true;
				}
				if (parsed < st->net.rx_len) {
					memmove(st->net.rx, st->net.rx + parsed, st->net.rx_len - parsed);
				}
				st->net.rx_len -= parsed;
				st->headers_done = true;
				rx_len = st->net.rx_len;
			}
		}

		if (st->headers_done && rx_len > 0) {
			size_t take = (count < rx_len) ? count : rx_len;
			memcpy(buf, st->net.rx, take);
			if (take < st->net.rx_len) {
				memmove(st->net.rx, st->net.rx + take, st->net.rx_len - take);
			}
			st->net.rx_len -= take;
			cyw43_arch_lwip_end();
			return (ssize_t)take;
		}
		cyw43_arch_lwip_end();

		if (had_error || (done && st->headers_done)) {
			stream->eof = 1;
			return 0;
		}
		if (done && !st->headers_done) {
			stream->eof = 1;
			return 0;
		}
		if (time_reached(deadline)) {
			stream->eof = 1;
			return 0;
		}
		sleep_ms(1);
	}
}

static int rp2350_http_stream_close(php_stream *stream, int close_handle)
{
	rp2350_http_stream_data_t *st = (rp2350_http_stream_data_t *)stream->abstract;
	(void)close_handle;
	if (!st) {
		return 0;
	}
	rp2350_h2_altcp_close(&st->net);
	if (st->net.rx) {
		free(st->net.rx);
		st->net.rx = NULL;
	}
	if (st->h2_session) {
		nghttp2_session_del(st->h2_session);
		st->h2_session = NULL;
	}
	if (st->h2_callbacks) {
		nghttp2_session_callbacks_del(st->h2_callbacks);
		st->h2_callbacks = NULL;
	}
	free(st->h2.tx);
	st->h2.tx = NULL;
	free(st->h2.body);
	st->h2.body = NULL;
	efree(st);
	stream->abstract = NULL;
	return 0;
}

static int rp2350_http_stream_flush(php_stream *stream)
{
	(void)stream;
	return 0;
}

static int rp2350_http_stream_seek(php_stream *stream, zend_off_t offset, int whence, zend_off_t *newoffs)
{
	(void)stream;
	(void)offset;
	(void)whence;
	(void)newoffs;
	return -1;
}

static const php_stream_ops rp2350_http_stream_ops = {
	rp2350_http_stream_write,
	rp2350_http_stream_read,
	rp2350_http_stream_close,
	rp2350_http_stream_flush,
	"rp2350_http_stream",
	rp2350_http_stream_seek,
	NULL,
	NULL,
	NULL
};

static php_stream *rp2350_http_stream_opener(
	php_stream_wrapper *wrapper,
	const char *filename,
	const char *mode,
	int options,
	zend_string **opened_path,
	php_stream_context *context STREAMS_DC
)
{
	char host[96];
	u16_t port;
	const char *path;
	bool is_https = false;
	ip_addr_t remote;
	absolute_time_t deadline;
	rp2350_http_stream_data_t *st = NULL;
	altcp_allocator_t tls_allocator = {0};
	rp2350_h2_tls_alloc_ctx_t tls_ctx = {0};
	php_stream *stream = NULL;
	const char *alpn = NULL;
	int connect_attempt = 0;
	int connect_attempts = 1;

