igorwwwwwwwwwwwwwwwwwwww/php-src/sapi/rp2350/src/rp2350_http_stream.c
	(void)context;

	if (!filename || (strncmp(filename, "http://", 7) != 0 && strncmp(filename, "https://", 8) != 0)) {
		return NULL;
	}
	if (!mode || mode[0] != 'r' || mode[1] == '+') {
		if (options & REPORT_ERRORS) {
			php_error_docref(NULL, E_WARNING, "rp2350 http wrapper is read-only");
		}
		return NULL;
	}

	if (!rp2350_parse_http_url(filename, host, sizeof(host), &port, &path, &is_https)) {
		php_stream_wrapper_log_error(wrapper, options, "url parse failed: %s", filename ? filename : "<null>");
		return NULL;
	}

	if (!rp2350_wifi_init_once()) {
		php_stream_wrapper_log_error(wrapper, options, "wifi init failed");
		return NULL;
	}
	if (cyw43_tcpip_link_status(&cyw43_state, CYW43_ITF_STA) != CYW43_LINK_UP) {
		php_stream_wrapper_log_error(wrapper, options, "wifi not connected");
		return NULL;
	}
	if (!rp2350_dns_resolve(host, 8000, &remote)) {
		php_stream_wrapper_log_error(wrapper, options, "dns resolve failed: %s", host);
		return NULL;
	}

	if (is_https && !rp2350_h2_tls_config_ready()) {
		php_stream_wrapper_log_error(wrapper, options, "https tls config not ready");
		return NULL;
	}

	st = (rp2350_http_stream_data_t *)ecalloc(1, sizeof(*st));
	if (!st) {
		php_stream_wrapper_log_error(wrapper, options, "state alloc failed");
		return NULL;
	}
	st->timeout_ms = 8000;
	st->net.rx_cap = 32768;
	st->net.rx = (char *)malloc(st->net.rx_cap + 1);
	if (!st->net.rx) {
		php_stream_wrapper_log_error(wrapper, options, "rx alloc failed");
		efree(st);
		return NULL;
	}
	st->net.last_rx_time = get_absolute_time();
	st->mode = RP2350_HTTP_STREAM_MODE_H1;
	connect_attempts = is_https ? 2 : 1;

	if (is_https) {
		tls_ctx.config = s_h2_tls_config;
		tls_ctx.hostname = host;
		tls_allocator.alloc = rp2350_h2_tls_alloc_with_sni;
		tls_allocator.arg = &tls_ctx;
	}

	for (connect_attempt = 0; connect_attempt < connect_attempts; connect_attempt++) {
		deadline = make_timeout_time_ms(st->timeout_ms);
		st->net.connected = false;
		st->net.had_error = false;
		st->net.done = false;
		st->net.last_err = ERR_OK;
		st->net.pcb = NULL;

		cyw43_arch_lwip_begin();
		st->net.pcb = altcp_new_ip_type(is_https ? &tls_allocator : NULL, IP_GET_TYPE(&remote));
		if (st->net.pcb != NULL) {
			altcp_arg(st->net.pcb, &st->net);
			altcp_recv(st->net.pcb, rp2350_h2_altcp_recv_cb);
			altcp_err(st->net.pcb, rp2350_h2_altcp_err_cb);
			st->net.last_err = altcp_connect(st->net.pcb, &remote, port, rp2350_h2_altcp_connected_cb);
			if (st->net.last_err != ERR_OK) {
				altcp_arg(st->net.pcb, NULL);
				altcp_recv(st->net.pcb, NULL);
				altcp_err(st->net.pcb, NULL);
				altcp_abort(st->net.pcb);
				st->net.pcb = NULL;
			}
		}
		cyw43_arch_lwip_end();

		if (st->net.pcb != NULL && rp2350_lwip_wait_until(deadline, &st->net.connected) && !st->net.had_error) {
			break;
		}

		rp2350_h2_altcp_close(&st->net);
		if (connect_attempt + 1 < connect_attempts) {
			sleep_ms(50);
		}
	}
	if (st->net.pcb == NULL || !st->net.connected || st->net.had_error) {
		if (is_https && st->net.pcb != NULL) {
			const char *tls_alpn = NULL;
			const char *tls_ver = NULL;
			const char *tls_cipher = NULL;
			uint32_t tls_verify = 0;
			bool tls_ctx_ok = false;
			cyw43_arch_lwip_begin();
			{
				void *tls = altcp_tls_context(st->net.pcb);
				if (tls != NULL) {
					mbedtls_ssl_context *ssl = (mbedtls_ssl_context *)tls;
					tls_ctx_ok = true;
					tls_alpn = mbedtls_ssl_get_alpn_protocol(ssl);
					tls_ver = mbedtls_ssl_get_version(ssl);
					tls_cipher = mbedtls_ssl_get_ciphersuite(ssl);
					tls_verify = mbedtls_ssl_get_verify_result(ssl);
				}
			}
			cyw43_arch_lwip_end();
			if (tls_ctx_ok) {
				php_stream_wrapper_log_error(
					wrapper,
					options,
					"connect timeout/error lwip=%d connected=%d had_error=%d verify=0x%08" PRIx32 " ver=%s cipher=%s alpn=%s",
					(int)st->net.last_err,
					st->net.connected ? 1 : 0,
					st->net.had_error ? 1 : 0,
					tls_verify,
					tls_ver ? tls_ver : "<null>",
					tls_cipher ? tls_cipher : "<null>",
					tls_alpn ? tls_alpn : "<null>"
				);
			} else {
				php_stream_wrapper_log_error(
					wrapper,
					options,
					"connect timeout/error lwip=%d connected=%d had_error=%d tls=<null>",
					(int)st->net.last_err,
					st->net.connected ? 1 : 0,
					st->net.had_error ? 1 : 0
				);
			}
		} else {
			php_stream_wrapper_log_error(
				wrapper,
				options,
				"connect timeout/error lwip=%d connected=%d had_error=%d",
				(int)st->net.last_err,
				st->net.connected ? 1 : 0,
				st->net.had_error ? 1 : 0
			);
		}
		rp2350_h2_altcp_close(&st->net);
		free(st->net.rx);
		efree(st);
		return NULL;
	}

	if (is_https) {
		const char *tls_ver = NULL;
		const char *tls_cipher = NULL;
		cyw43_arch_lwip_begin();
		if (st->net.pcb != NULL) {
			void *tls = altcp_tls_context(st->net.pcb);
			if (tls != NULL) {
				mbedtls_ssl_context *ssl = (mbedtls_ssl_context *)tls;
				alpn = mbedtls_ssl_get_alpn_protocol(ssl);
				tls_ver = mbedtls_ssl_get_version(ssl);
				tls_cipher = mbedtls_ssl_get_ciphersuite(ssl);
			}
		}
		cyw43_arch_lwip_end();
		printf(
			"[tls] connected ver=%s cipher=%s alpn=%s\n",
			tls_ver ? tls_ver : "<null>",
			tls_cipher ? tls_cipher : "<null>",
			alpn ? alpn : "<null>"
		);
		if (alpn != NULL && strcmp(alpn, "h2") == 0) {
			nghttp2_nv nva[5];
			int rc;

			st->mode = RP2350_HTTP_STREAM_MODE_H2;
			st->h2.body_dynamic = true;
			st->h2.body_limit = 131072;

			rc = nghttp2_session_callbacks_new(&st->h2_callbacks);
			if (rc != 0) {
				if (options & REPORT_ERRORS) {
					php_error_docref(NULL, E_WARNING, "https wrapper: h2 callbacks alloc failed: %d", rc);
				}
				rp2350_h2_altcp_close(&st->net);
				free(st->net.rx);
				efree(st);
				return NULL;
			}
			nghttp2_session_callbacks_set_send_callback(st->h2_callbacks, rp2350_h2_send_cb);
			nghttp2_session_callbacks_set_on_header_callback(st->h2_callbacks, rp2350_h2_on_header_cb);
			nghttp2_session_callbacks_set_on_data_chunk_recv_callback(st->h2_callbacks, rp2350_h2_on_data_chunk_recv_cb);
			nghttp2_session_callbacks_set_on_stream_close_callback(st->h2_callbacks, rp2350_h2_on_stream_close_cb);

			rc = nghttp2_session_client_new(&st->h2_session, st->h2_callbacks, &st->h2);
			if (rc != 0) {
				if (options & REPORT_ERRORS) {
					php_error_docref(NULL, E_WARNING, "https wrapper: h2 session alloc failed: %d", rc);
				}
				rp2350_h2_altcp_close(&st->net);
				free(st->net.rx);
				nghttp2_session_callbacks_del(st->h2_callbacks);
				efree(st);
				return NULL;
			}

