igorwwwwwwwwwwwwwwwwwwww/php-src/sapi/rp2350/src/rp2350_http_stream.c
			rc = nghttp2_submit_settings(st->h2_session, NGHTTP2_FLAG_NONE, NULL, 0);
			if (rc != 0) {
				if (options & REPORT_ERRORS) {
					php_error_docref(NULL, E_WARNING, "https wrapper: h2 submit settings failed: %d", rc);
				}
				rp2350_h2_altcp_close(&st->net);
				free(st->net.rx);
				nghttp2_session_del(st->h2_session);
				nghttp2_session_callbacks_del(st->h2_callbacks);
				efree(st);
				return NULL;
			}

			memset(nva, 0, sizeof(nva));
			nva[0].name = (uint8_t *)":method";
			nva[0].value = (uint8_t *)"GET";
			nva[0].namelen = sizeof(":method") - 1;
			nva[0].valuelen = sizeof("GET") - 1;
			nva[1].name = (uint8_t *)":scheme";
			nva[1].value = (uint8_t *)"https";
			nva[1].namelen = sizeof(":scheme") - 1;
			nva[1].valuelen = sizeof("https") - 1;
			nva[2].name = (uint8_t *)":authority";
			nva[2].value = (uint8_t *)host;
			nva[2].namelen = sizeof(":authority") - 1;
			nva[2].valuelen = strlen(host);
			nva[3].name = (uint8_t *)":path";
			nva[3].value = (uint8_t *)path;
			nva[3].namelen = sizeof(":path") - 1;
			nva[3].valuelen = strlen(path);
			nva[4].name = (uint8_t *)"user-agent";
			nva[4].value = (uint8_t *)"rp2350-php";
			nva[4].namelen = sizeof("user-agent") - 1;
			nva[4].valuelen = sizeof("rp2350-php") - 1;

			st->h2.stream_id = nghttp2_submit_request(st->h2_session, NULL, nva, 5, NULL, NULL);
			if (st->h2.stream_id < 0) {
				if (options & REPORT_ERRORS) {
					php_error_docref(NULL, E_WARNING, "https wrapper: h2 submit request failed: %d", (int)st->h2.stream_id);
				}
				rp2350_h2_altcp_close(&st->net);
				free(st->net.rx);
				nghttp2_session_del(st->h2_session);
				nghttp2_session_callbacks_del(st->h2_callbacks);
				efree(st);
				return NULL;
			}

			rc = nghttp2_session_send(st->h2_session);
			if (rc != 0 || !rp2350_h2_flush_tx(&st->h2, &st->net, deadline)) {
				if (options & REPORT_ERRORS) {
					php_error_docref(NULL, E_WARNING, "https wrapper: h2 send failed: rc=%d lwip=%d", rc, (int)st->net.last_err);
				}
				rp2350_h2_altcp_close(&st->net);
				free(st->net.rx);
				nghttp2_session_del(st->h2_session);
				nghttp2_session_callbacks_del(st->h2_callbacks);
				efree(st);
				return NULL;
			}
		}
	}

	if (st->mode == RP2350_HTTP_STREAM_MODE_H1) {
		char *request = NULL;
		size_t request_len = 0;
		size_t off = 0;

			if (!rp2350_http_build_get_request(host, path, &request, &request_len)) {
				php_stream_wrapper_log_error(wrapper, options, "request build failed");
				rp2350_h2_altcp_close(&st->net);
				free(st->net.rx);
				efree(st);
			return NULL;
		}

		while (off < request_len) {
			bool wrote = false;
			cyw43_arch_lwip_begin();
			if (st->net.pcb != NULL) {
				u16_t snd = altcp_sndbuf(st->net.pcb);
				if (snd > 0) {
					u16_t chunk = (u16_t)((request_len - off) < snd ? (request_len - off) : snd);
					err_t w = altcp_write(st->net.pcb, request + off, chunk, TCP_WRITE_FLAG_COPY);
					if (w == ERR_OK) {
						off += chunk;
						(void)altcp_output(st->net.pcb);
						wrote = true;
					} else if (w != ERR_MEM) {
						st->net.had_error = true;
						st->net.last_err = w;
					}
				}
			}
			cyw43_arch_lwip_end();
			if (st->net.had_error || st->net.pcb == NULL) {
				php_stream_wrapper_log_error(wrapper, options, "request write failed lwip=%d", (int)st->net.last_err);
				rp2350_h2_altcp_close(&st->net);
				free(st->net.rx);
				free(request);
				efree(st);
				return NULL;
			}
			if (!wrote) {
				if (time_reached(deadline)) {
					php_stream_wrapper_log_error(wrapper, options, "request write timeout");
					rp2350_h2_altcp_close(&st->net);
					free(st->net.rx);
					free(request);
					efree(st);
					return NULL;
				}
				sleep_ms(1);
			}
		}
		free(request);

		cyw43_arch_lwip_begin();
		if (st->net.pcb != NULL) {
			(void)altcp_shutdown(st->net.pcb, 0, 1);
		}
		cyw43_arch_lwip_end();
	}

	stream = php_stream_alloc(&rp2350_http_stream_ops, st, 0, mode);
	if (!stream) {
		php_stream_wrapper_log_error(wrapper, options, "stream alloc failed");
		rp2350_h2_altcp_close(&st->net);
		free(st->net.rx);
		efree(st);
		return NULL;
	}
	stream->wrapper = wrapper;

	if (opened_path) {
		*opened_path = zend_string_init(filename, strlen(filename), 0);
	}
	return stream;
}

static const php_stream_wrapper_ops rp2350_http_wrapper_ops = {
	rp2350_http_stream_opener,
	NULL,
	NULL,
	NULL,
	NULL,
	"rp2350_http_wrapper",
	NULL,
	NULL,
	NULL,
	NULL,
	NULL
};

static php_stream_wrapper rp2350_http_wrapper = {
	&rp2350_http_wrapper_ops,
	NULL,
	1
};

void rp2350_register_https_wrapper_runtime(void)
{
	zend_string *protocol = zend_string_init("https", sizeof("https") - 1, 0);
	if (!protocol) {
		php_error_docref(NULL, E_WARNING, "failed to allocate https protocol string");
		return;
	}
	(void)php_unregister_url_stream_wrapper_volatile(protocol);
	if (php_register_url_stream_wrapper_volatile(protocol, &rp2350_http_wrapper) != SUCCESS) {
		php_error_docref(NULL, E_WARNING, "failed to register https stream wrapper");
	}
	zend_string_release(protocol);
}
